import java.util.Scanner;

//8. Напишите метод, который принимает строку, перебирает и выводит в консоль по очереди все символы с конца строки.
public class Main {
    public static void main(String[] args) {
        Scanner scanner = new Scanner(System.in);
        System.out.println("Введите строку");
        String x = scanner.nextLine();

    }
    public static void metod(String x) {
        

        }

    }
